alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKK-stim-sense-INTAN/003_STIM_SENSE_IKKI_not_lpm_single_shot.c
//                   MSP430x47x
//                 -----------------
//             /|\|              XIN|-
//              | |                 |  32kHz xtal
//              --|  RST        XOUT|-
//                |  12         P4.6|--> LED
//                |                 |
//                |  --- INTAN ---  |            
//                |                 |
//                |  44         P3.0|-> SCLK B0  
//                |  43         P2.5|<- MISO B0  
//                |  42         P2.4|-> MOSI B0  
//                |  15         P4.3|--> LED for INTAN bug 
//                |  14         P4.4|--> CS for INTAN
//                |  13         P4.5|--> stim_en for INTAN
//                |                 |
//                |                 |               VCC (3.3V)     
//                |                 |                   |    
//                |                 |                   / (resistencia externa de pull-up, 10kΩ)    
//                |                 |                   |    
//                |  58         P1.0|--> Botón         P1.0
//                |                 |                   |    
//                |                 |               [ BOTÓN ]
//                |                 |                   |    
//                |                 |                  GND
//                |                 |
//                |  --- ESP32 ---  |                                           ESP32            
//                |                 |
//                |  18         P4.0|--> LED ESP32 communications indicator  
//                |  16         P4.2|-> CS for ESP32 -------------------------> - GPIO 15: A3 CS PARAM   
//                |  11         P4.7|-> CS for ESP32 ECG ---------------------> - GPIO 2: RX CS ECG                              - por si fuese necesaro habilitar otro bus SPI hacia el slave
//                |  41         P3.0|-> SCLK A0 ------------------------------> - GPIO 16: A2 SCLK PARAM 
//                |  75         P2.5|<- MISO A0 ------------------------------> - GPIO 17: A1 MISO PARAM 
//                |  76         P2.4|-> MOSI A0 ------------------------------> - GPIO 18: A0 MOSI PARAM 
//                |  54         P1.4|-> NEW_PARAM  ---------------------------> - GPIO 11: D11  
//                |  57         P1.1|<- ACK_PARAM  ---------------------------> - GPIO 12: D12
//                |  51         P1.5|-> ESP32 connected ----------------------> - GPIO 13: D13
//                |                 |-----------------------------------------> - GND
//                |                 |
//                |  ---  SPI  ---  |
//                |      USCIA0     |
//                |  76         P2.4|-> MOSI - USCIA0 
//                |  75         P2.5|<- MISO - USCIA0
//                |  41         P3.0|-> SCLK - USCIA0
//                |                 |
//                |  ---  SPI  ---  |
//                |      USCIB0     |
//                |  42         P2.4|-> MOSI - USCIB0 
//                |  43         P2.5|<- MISO - USCIB0
//                |  44         P3.0|-> SCLK - USCIB0
//                |                 |
//                |  ---  SD16 ---  |
//                |             P6.0|<------- A0+: ECG positive input --> 67
//                |             P6.1|<------- A0-: ECG negative input --> 66
//                |                 |
//                |  ---  CLK  ---  |
//                |                 |
//                |             P1.1|--> MCLK = 8Mhz  --> 57 (referencia DCO)
//                |             P1.4|--> SMCLK = 8MHz --> 54 (referencia DCO)
//                |             P1.5|--> ACLK = 32kHz --> 51
//                |                 |
//                |  ---  UART ---  |
//                |  75         P2.5|<------- Receive Data (UCA0RXD) 
//                |  76         P2.4|-------> Transmit Data (UCA0TXD) 
//                |                 |



#include <msp430.h>
#include <stdbool.h> 
#include <stdint.h>  

#include "IKKI_MAC.h"

#include "../config/SD16A_config.h"
#include "../config/SPI_config.h"
#include "../config/UART_config.h"
#include "../config/clk_config.h"
#include "../config/TIMER_config.h"

#include "../functions/system_config.h"
#include "../functions/general_functions.h"
#include "../functions/SD16_A.h"
#include "../functions/FLL.h"
#include "../functions/TIMER.h"


#include "../../../common/INTAN_config.h"
#include "../../../common/INTAN_functions.h"
#include "../../../common/register_macro.h"

volatile uint8_t high_word = 0x00;
volatile uint8_t low_word = 0xFF;
bool high_or_low = true;
int i;
uint16_t my_register = 0;

uint32_t timer_flag_on_off = 0;
uint32_t timer_flag_stim_rest = 0;
bool INTAN_programmed = false;
uint8_t number_of_stimulations_done = 10;

/*
  STIMULATION UPDATE PARAMETERS
*/
uint8_t resting_time_seconds = 0;
uint8_t stimulation_time_seconds = 0;
uint8_t high_byte_stimulation_on_time_micro = 0;
uint8_t low_byte_stimulation_on_time_micro = 0;
uint16_t stimulation_on_time_micro = 0;
uint8_t stimulation_off_time_milis = 0;
uint8_t positive_current_magnitude = 0;
uint8_t negative_current_magnitude = 0;
uint8_t high_byte_step_DAC = 0;
uint8_t low_byte_step_DAC = 0;
uint16_t step_DAC = 0;

/*
  SENSE UPDATE PARAMETERS
*/
uint8_t high_ADC_sampling_rate;
uint8_t low_ADC_sampling_rate;
uint8_t high_ADC_sampling_rate_2;
uint8_t low_ADC_sampling_rate_2;
uint8_t high_ADC_sampling_rate_3;
uint8_t high_high_byte_DSP_cutoff_frequency;
uint8_t high_byte_DSP_cutoff_frequency;
uint8_t low_byte_DSP_cutoff_frequency;
uint8_t low_low_byte_DSP_cutoff_frequency;
uint8_t high_high_byte_fc_high_magnitude;
uint8_t high_byte_fc_high_magnitude;
uint8_t low_byte_fc_high_magnitude;
uint8_t low_low_byte_fc_high_magnitude;
uint8_t high_high_byte_fc_low_A;
uint8_t high_byte_fc_low_A;
uint8_t low_byte_fc_low_A;
uint8_t low_low_byte_fc_low_A;
uint8_t high_high_byte_fc_low_B;
uint8_t high_byte_fc_low_B;
uint8_t low_byte_fc_low_B;
uint8_t low_low_byte_fc_low_B;
uint8_t amplifier_cutoff;
uint8_t fc_high_unit;
char amplifier_cutoff_frequency_A_B;

