alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKK-stim-sense-INTAN/003_STIM_SENSE_IKKI_not_lpm_single_shot.c
typedef union {
    float value;
    uint8_t bytes[4];
} float_bytes_union;


uint8_t received_channel_value_1;
uint8_t received_channel_value_2;


//Timer value configuration divider
uint32_t divider_value = 0x029A;

uint8_t RX;


bool new_parameters;
bool esp32_connected;
bool sent = false;
bool locked_button = false;


/*
  STRUCTURES FOR CONFIGURATION OF DEVICES
*/
CLK_config_struct CLK_config;
SD16A_config_struct SD16A_configuration;
TIMER_config_struct TIMER_config;
INTAN_config_struct INTAN_config;
SPI_config_struct SPI_config;
SPI_B_config_struct SPI_B_config;


uint8_t channel = 1;
uint8_t stim_channel = 0;


//************************** other parameters ************************** 
bool new_param = false;

uint32_t stim_on_off_time;
uint32_t stim_rest_time;
bool next_stim;

//************************** State machines ************************** 

typedef enum {ENVIO_INTAN, RX_PARAMS_ESP32, TX_PARAMS_INTAN, NEW_PARAM_OFF_WAIT} Estados;
Estados general_state = ENVIO_INTAN;


typedef enum {STIM, REST} states_stimulation;
states_stimulation state_stimulation = REST;

typedef enum {ON_P, OFF_P, ON_N, OFF_N} states_stimulation_ON_OFF;
states_stimulation_ON_OFF state_stimulation_ON_OFF = ON_P;

void config_SPI_A0_stim(SPI_config_struct* SPI_config){
  SPI_config->Master_Slave = 'M';       //M: Master, S: Slave
  SPI_config->inactive_state = 'L';     // clock polarity inactive low
  //data cHanged on the first UCLK edge and captured on the following edge
  //data cAptured on the first UCLK edge and changed on the following edge
  SPI_config->data_on_clock_edge = 'A'; 
  SPI_config->SPI_length = 8;
  SPI_config->first_Byte_sent = 'M'; //M: MSB, L: LSB
    /*clk_ref:
      U --> UCLK
      A --> ACLK
      S --> SMCLK
  */
  SPI_config->clk_ref_SPI = 'S';
  SPI_config->clk_div = 2;
  SPI_config->enable_USCI_interr_rx = false;
  SPI_config->enable_USCI_interr_tx = false;
}

void config_SPI_B0_stim(SPI_B_config_struct* SPI_B_config){
  SPI_B_config->Master_Slave = 'M';       //M: Master, S: Slave
  SPI_B_config->inactive_state = 'L';     // clock polarity inactive low
  //data cHanged on the first UCLK edge and captured on the following edge
  //data cAptured on the first UCLK edge and changed on the following edge
  SPI_B_config->data_on_clock_edge = 'A'; 
  SPI_B_config->SPI_length = 8;
  SPI_B_config->first_Byte_sent = 'M'; //M: MSB, L: LSB
    /*clk_ref:
      U --> UCLK
      A --> ACLK
      S --> SMCLK
  */
  SPI_B_config->clk_ref_SPI = 'S';
  SPI_B_config->clk_div = 2;
  SPI_B_config->enable_USCI_interr_rx = false;
  SPI_B_config->enable_USCI_interr_tx = false;
}


void config_SD16A(SD16A_config_struct* SD16A_configuration){
  
      // -- Entrada analógica
      SD16A_configuration->analog_input_being_sampled = 0;
      SD16A_configuration->analog_input_count = 1;
      SD16A_configuration->analog_input[0] = ECG;  // 0: A0 - ECG
      SD16A_configuration->analog_input_ID[0] = 0x30; // 0: A0 - ECG

      // -- Tensión de referencia
      SD16A_configuration->v_ref = 'I'; // I: Internal (1.2V), O: Off-chip, E: External
              // -- Reloj de referencia
      SD16A_configuration->clk_ref = 'M'; // M: MCLK, S: SMCLK, A: AC1LK, T: TACLK
                                        // -- Divisor de frecuencia de referencia
      SD16A_configuration->clk_div_1 = 1;
      SD16A_configuration->clk_div_2 = 1;
      // -- Método de lectura: Polling o Interrupciones
      SD16A_configuration->interruption_SD16A = true;
      // -- Over Sampling Ratio
      SD16A_configuration->OSR = 512; // 1, 32, 64, 128, 256, 512, 1024
      // -- Ganancia
      SD16A_configuration->gain = 1; // 1, 2, 4, 8, 16 or 32
      // -- Método de conversión
      SD16A_configuration->conv_mode = 'C'; // C: Continuous  S: Single
                                          // -- Tipo de datos
      SD16A_configuration->polarity = 'B';  // B : Bipolar, U : unipolar
      SD16A_configuration->sign = 'O';      // O : Offset, C : 2's complement

      SD16A_configuration->sampled = false;
}

void configure_INTAN(INTAN_config_struct* INTAN_config){


  /* 
    STIMULATION DISABLE AND MINIMUM POWER DISIPATION
  */
  INTAN_config->ADC_sampling_rate = 13;
  /*
    DSP FOR HIGH PASS FILTER REMOVAL
  */
  INTAN_config->DSP_cutoff_freq = 4.665;
  INTAN_config->number_channels_to_convert = 1;

  /*
    ELECTRODE IMPEDANCE TEST
  */
  INTAN_config->zcheck_select = 0;
  INTAN_config->zcheck_load = 0;
  INTAN_config->zcheck_scale = 0;
  INTAN_config->zcheck_en = 0;
  INTAN_config->zcheck_DAC_power = 1;
  INTAN_config->zcheck_DAC_value = 128;

  /*
    AMPLIFIER BANDWIDTH
  */
   
  INTAN_config->fh_magnitude = 7.5;
  INTAN_config->fh_unit = 'k';
  INTAN_config->fc_low_A = 5;
  INTAN_config->fc_low_B = 1000.0;

  INTAN_config->amplifier_cutoff_frequency_A_B[channel] = 'A';


  /*
    CONSTANT CURRENT STIMULATOR
  */
  INTAN_config->step_DAC = 5000; // uA
  INTAN_config->negative_current_magnitude[stim_channel] = 100;
  INTAN_config->negative_current_trim[stim_channel] = 0x80;
  INTAN_config->positive_current_magnitude[stim_channel] = 100;
  INTAN_config->positive_current_trim[stim_channel] = 0x80;

  // INTAN_config->MASTER_FREQ = 8000000;


  /*
    CURRENT LIMITED CHARGE RECOVERY CIRCUIT
  */             
  
  INTAN_config->voltage_recovery = 0;
  INTAN_config->current_recovery = 1;

  /*
    STIMULATION PARAMETERS
  */
  INTAN_config->stimulation_time = 0;
  // INTAN_config->stimulation_time = 366412;
  // INTAN_config->resting_time = 3664122;
  INTAN_config->resting_time = 0;
  INTAN_config->stimulation_on_time = 0;
  INTAN_config->stimulation_off_time = 0;    

  INTAN_config->number_of_stimulations = 2;
}

void receive_parameters_ESP32(INTAN_config_struct* INTAN_config){
    ON_ACK_param();
        __delay_cycles(1000);



        // ----------------------------------------------------------------------
        // OPEN chip select
        // ----------------------------------------------------------------------
        OFF_CS_ESP_PARAM_pin();
        
