alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKK-stim-sense-INTAN/003_STIM_SENSE_IKKI_not_lpm_single_shot.c
        /*
          SENSE RELATED PARAMETERS
        */

        // ----------------------------------------------------------------------
        // ADC sampling rate (2 bytes)
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0xB0;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        uint8_t high_ADC_sampling_rate = UCA0RXBUF;

        UCA0TXBUF = 0xC0;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        uint8_t low_ADC_sampling_rate = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // Channels to convert (1 byte)
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0xD0;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        INTAN_config->number_channels_to_convert = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // DSP enabled (1 byte)
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0xE0;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        INTAN_config->DSPen = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // DSP cutoff frequency (float → 4 bytes)
        // ----------------------------------------------------------------------
        uint8_t dsp_bytes[4];

        UCA0TXBUF = 0xF0;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        dsp_bytes[0] = UCA0RXBUF;

        UCA0TXBUF = 0x01;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        dsp_bytes[1] = UCA0RXBUF;

        UCA0TXBUF = 0x02;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        dsp_bytes[2] = UCA0RXBUF;

        UCA0TXBUF = 0x03;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        dsp_bytes[3] = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // Initial channel (1 byte)
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x04;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        INTAN_config->initial_channel_to_convert = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // fc high magnitude (float → 4 bytes)
        // ----------------------------------------------------------------------
        uint8_t fcH_bytes[4];

        UCA0TXBUF = 0x05;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcH_bytes[0] = UCA0RXBUF;

        UCA0TXBUF = 0x06;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcH_bytes[1] = UCA0RXBUF;

        UCA0TXBUF = 0x07;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcH_bytes[2] = UCA0RXBUF;

        UCA0TXBUF = 0x08;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcH_bytes[3] = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // fc high unit (1 byte)
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x09;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fc_high_unit = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // fc low A (float → 4 bytes)
        // ----------------------------------------------------------------------
        uint8_t fcA_bytes[4];

        UCA0TXBUF = 0x0A;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcA_bytes[0] = UCA0RXBUF;

        UCA0TXBUF = 0x0B;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcA_bytes[1] = UCA0RXBUF;

        UCA0TXBUF = 0x0C;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcA_bytes[2] = UCA0RXBUF;

        UCA0TXBUF = 0x0D;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcA_bytes[3] = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // fc low B (float → 4 bytes)
        // ----------------------------------------------------------------------
        uint8_t fcB_bytes[4];

        UCA0TXBUF = 0x0E;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcB_bytes[0] = UCA0RXBUF;

        UCA0TXBUF = 0x0F;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcB_bytes[1] = UCA0RXBUF;

        UCA0TXBUF = 0x11;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcB_bytes[2] = UCA0RXBUF;

        UCA0TXBUF = 0x12;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        fcB_bytes[3] = UCA0RXBUF;


        // ----------------------------------------------------------------------
        // Amplifier cutoff (1 byte)
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x13;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        INTAN_config->amplifier_cutoff_frequency_A_B[channel] = (char)UCA0RXBUF;

        // ----------------------------------------------------------------------
        // C2 enable
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x14;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        INTAN_config->C2_enabled = (bool)UCA0RXBUF;

        // ----------------------------------------------------------------------
        // absolute value mode
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x15;
        while (!(IFG2 & UCA0RXIFG));
        __delay_cycles(30);
        INTAN_config->abs_mode = (bool)UCA0RXBUF;

        /*
          STRIMULATION RELATED PARAMETERS
        */

        // ---------------------------------------------------------------------- 
        // Number of stimulations
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x10;
        while (!(IFG2 & UCA0RXIFG));              // number of stimulations
        INTAN_config->number_of_stimulations = UCA0RXBUF;

        // ----------------------------------------------------------------------
        // Resting time
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x20;
        while (!(IFG2 & UCA0RXIFG));              // resting_time_seconds
        resting_time_seconds = UCA0RXBUF;

        // ----------------------------------------------------------------------
        // Stimulation time
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x30;
        while (!(IFG2 & UCA0RXIFG));              // stimulation_time_seconds
        stimulation_time_seconds = UCA0RXBUF;

        // ----------------------------------------------------------------------
        // Stimulation ON time (2 bytes)
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x40;
        while (!(IFG2 & UCA0RXIFG));              // stimulation_on_time_micro high byte
        high_byte_stimulation_on_time_micro = UCA0RXBUF;
        UCA0TXBUF = 0x50;
        while (!(IFG2 & UCA0RXIFG));              // stimulation_on_time_micro low byte
        low_byte_stimulation_on_time_micro = UCA0RXBUF;
        
        // ----------------------------------------------------------------------
        // Stimulation OFF time 
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x60;
        while (!(IFG2 & UCA0RXIFG));              // stimulation_off_time
        stimulation_off_time_milis = UCA0RXBUF;

        // ----------------------------------------------------------------------
        // Positive current magnitude
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x70;
        while (!(IFG2 & UCA0RXIFG));              // positive_current_magnitude
        INTAN_config->positive_current_magnitude[stim_channel] = UCA0RXBUF;

        // ----------------------------------------------------------------------
        // Negative current magnitude
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x80;
        while (!(IFG2 & UCA0RXIFG));              // negative_current_magnitude
        INTAN_config->negative_current_magnitude[stim_channel] = UCA0RXBUF;

        // ----------------------------------------------------------------------
        // High step DAC
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0x90;
        while (!(IFG2 & UCA0RXIFG));              // high_byte_step_DAC
        high_byte_step_DAC = UCA0RXBUF;
        
        // ----------------------------------------------------------------------
        // Low step DAC
        // ----------------------------------------------------------------------
        UCA0TXBUF = 0xA0;
        while (!(IFG2 & UCA0RXIFG));              // low_byte_step_DAC
        low_byte_step_DAC = UCA0RXBUF;



        // ----------------------------------------------------------------------
        // CLOSE chip select
        // ----------------------------------------------------------------------
        ON_CS_ESP_PARAM_pin();




