alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKK-stim-sense-INTAN/003_STIM_SENSE_IKKI_not_lpm_single_shot.c
        // ======================================================================
        // RECONSTRUCT 16-bit AND FLOAT PARAMETERS
        // ======================================================================

        /*
          STIMULATION RELATED PARAMETERS
        */
        stimulation_on_time_micro = ((uint16_t)high_byte_stimulation_on_time_micro << 8) | low_byte_stimulation_on_time_micro;
        step_DAC = ((uint16_t)high_byte_step_DAC << 8) | low_byte_step_DAC;

        INTAN_config->MASTER_FREQ = 8000000;
        INTAN_config->resting_time = resting_time_seconds*INTAN_config->MASTER_FREQ/divider_value;
        // INTAN_config->resting_time = resting_time_seconds*60*INTAN_config->MASTER_FREQ/divider_value;
        INTAN_config->stimulation_time = (stimulation_time_seconds*INTAN_config->MASTER_FREQ)/(divider_value*1.14);
        
        INTAN_config->stimulation_on_time = stimulation_on_time_micro*(INTAN_config->MASTER_FREQ/divider_value)/1000000;
        INTAN_config->stimulation_off_time = stimulation_off_time_milis*INTAN_config->MASTER_FREQ/(1000*divider_value);

        INTAN_config->step_DAC = step_DAC; 


        /*
          SENSING RELATED PARAMETERS
        */
        // ADC sampling rate
        INTAN_config->ADC_sampling_rate =
            ((uint16_t)high_ADC_sampling_rate << 8) | low_ADC_sampling_rate;

        // DSP cutoff frequency (float)
        memcpy(&INTAN_config->DSP_cutoff_freq, dsp_bytes, 4);

        // fc high magnitude (float)
        memcpy(&INTAN_config->fh_magnitude, fcH_bytes, 4);

        // fc low A (float)
        memcpy(&INTAN_config->fc_low_A, fcA_bytes, 4);

        // fc low B (float)
        memcpy(&INTAN_config->fc_low_B, fcB_bytes, 4);

}

void update_stim_parameters(){

  if(number_of_stimulations_done < INTAN_config.number_of_stimulations){ // si el número de estimulaciones hechas es menor al que se quiere hacer
    ON_pin();
    switch (state_stimulation) {
      case STIM:
        if(timer_flag_stim_rest >= stim_rest_time){
          state_stimulation = REST;
          timer_flag_stim_rest = 0;
          stim_rest_time = INTAN_config.resting_time;
          number_of_stimulations_done++;
          INTAN_programmed = false;

          break;
        }
          switch (state_stimulation_ON_OFF) {
            case ON_P:
              if(timer_flag_on_off >= stim_on_off_time){
                state_stimulation_ON_OFF = OFF_P;
                timer_flag_on_off = 0;
                stim_on_off_time = INTAN_config.stimulation_off_time;
                INTAN_programmed = false;
                break;
              }          
              if(!INTAN_programmed){
                INTAN_config.stimulation_on[0] = 1;
                INTAN_config.stimulation_pol[0] = 'P';
                ON_INTAN_FASTER(&INTAN_config, stim_channel);
                // ON_INTAN_FASTER(&INTAN_config, channel);
                INTAN_programmed = true;
              }
              
              break;

            case OFF_P:
              if(timer_flag_on_off >= stim_on_off_time){
                state_stimulation_ON_OFF = ON_N;
                timer_flag_on_off = 0;
                stim_on_off_time = INTAN_config.stimulation_on_time;
                INTAN_programmed = false;
                break;
              }          
              if(!INTAN_programmed){
                OFF_INTAN_FASTER(&INTAN_config);                          
                // OFF_INTAN_FASTER(&INTAN_config);                          
                INTAN_programmed = true;
              }
              
              
              break;

            case ON_N:
              if(timer_flag_on_off >= stim_on_off_time){
                state_stimulation_ON_OFF = OFF_N;
                timer_flag_on_off = 0;
                stim_on_off_time = INTAN_config.stimulation_off_time;
                INTAN_programmed = false;
                break;
              }
              if(!INTAN_programmed){
                INTAN_config.stimulation_on[0] = 1;
                INTAN_config.stimulation_pol[0] = 'N';
                ON_INTAN_FASTER(&INTAN_config, stim_channel);
                // ON_INTAN(&INTAN_config);
                INTAN_programmed = true;
              }

              
              break;

            case  OFF_N:
              if(timer_flag_on_off >= stim_on_off_time){
                state_stimulation_ON_OFF = ON_P;
                timer_flag_on_off = 0;
                stim_on_off_time = INTAN_config.stimulation_on_time;
                INTAN_programmed = false;
                break;
              }
              if(!INTAN_programmed){
                OFF_INTAN_FASTER(&INTAN_config);
                // OFF_INTAN_FASTER(&INTAN_config);
                INTAN_programmed = true;
              }
              break;

          }
        break;

      case REST:
          if(timer_flag_stim_rest >= stim_rest_time){
            state_stimulation = STIM;
            timer_flag_stim_rest = 0;
            stim_rest_time = INTAN_config.stimulation_time;
            state_stimulation_ON_OFF = ON_P;
            INTAN_programmed = false;
            break;
          }
          if(!INTAN_programmed){
            OFF_INTAN_FASTER(&INTAN_config);
            INTAN_programmed = true;
          }
        break;
    
    }
  }else{
    next_stim = button_pressed();
    OFF_pin();
  }
}

void config_CLK(CLK_config_struct* CLK_config){
  // Modo de operación
  /*    mode:
          - A: Active
          - L: Low Power
              - 0: LPM0
              - 1: LPM1
              - 2: LPM2
              - 3: LPM3
  */
  CLK_config->operating_mode = 'A';
  // Oscilador LFXT1
  /*
      L: Low Frequency Mode --> f auxiliar de 323kHz conectado
      H: High Frequency Mode
  */
  CLK_config->LFXT1_wk_mode = 'L';
  // Configura la capacidad interna del LFXT1
  /*0  --> XIN Cap = XOUT Cap = 0pf */
  /*10 --> XIN Cap = XOUT Cap = 10pf */
  /*14 --> XIN Cap = XOUT Cap = 14pf */
  /*18 --> XIN Cap = XOUT Cap = 18pf */
  CLK_config->LFXT1_int_cap = 0;
  // DCO
  // Rango de frecuencia de trabajo del DCO:
  /*2 --> fDCOCLK =   1.4-12MHz*/
  /*3 --> fDCOCLK =   2.2-17Mhz*/
  /*4 --> fDCOCLK =   3.2-25Mhz*/ //-> 8 MHz
  /*8 --> fDCOCLK =     5-40Mhz*/
  CLK_config->DCO_range = 4;
  // Values for setting the frequency of the DCO+
  // DCO+ set so freq= xtal x D x N_MCLK+1
  // XTAL --> 32767Hz
  CLK_config->DCOPLUS_on = true;                // If D factor is wanted to be applied then -> True
  CLK_config->D_val = 2;    // Max 8
  CLK_config->N_MCLK = 127; // Max 127
  // CLK_config->N_MCLK = 95; // Max 127
  // MCLK
  // Reference selection for MCLK
  CLK_config->ref_MCLK = 'D'; //  D: DCO, X: XT2, A: LFXT1
  // ACLK
  // ACLK division for configuring ACLK/N
  CLK_config->divider_ACLK = 1; // 1, 2, 4, 8
  // SMCLK
  //  Reference for SMCLK
  CLK_config->ref_SMCLK = 'D'; // D: DCO, X: XT2, N: OFF
  // LFXT2
  // Second oscillator ON OFF
  CLK_config->LFXT2_osc_on = false;
}

void config_CLK_8MHz(CLK_config_struct CLK_config){
  stop_wd();
  CLK_config.DCO_range = 4;
  CLK_config.N_MCLK = 121;
  CLK_config.DCOPLUS_on = true;
  CLK_config.D_val = 1;
  DCO_f_range(CLK_config.DCO_range);
  configure_N_for_MCLK (CLK_config.N_MCLK);
  LFXT1_internal_cap_config(18);
  FLL_CTL0 |= DCOPLUS;           // DCO+ set so freq= xtal x D x N+1  
  configure_PINS_for_clk_debug();
}

int main(void)
{


  /* COMMON CONFIGURATION */
  
