alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKK-stim-sense-INTAN/003_STIM_SENSE_IKKI_not_lpm_single_shot.c
  general_setup(CLK_config);
  init_MSP();
  enable_interruptions(true);


  //************************** CLK configuration *****************************
  // config_CLK(&CLK_config);
  // run_functions_setup_CLK(CLK_config);
  config_CLK_8MHz(CLK_config);

  //************************** LED configuration *****************************
  toggle_setup();

  //************************** SPI comms configuration INTAN *****************************
  config_SPI_B0_stim(&SPI_B_config);
  SPI_B_setup(&SPI_B_config);

  //************************** INTAN programming setup ************************** 
  INTAN_LED_setup(); // Setup P4.3 for LED output
  OFF_INTAN_LED();

  CS_INTAN_setup();
  ON_CS_INTAN_pin();
  // stim_en_setup();
  // stim_en_OFF();

  //************************** External button setup  ************************** 
  button_init();
  next_stim = button_pressed(); 


  //************************** TIMER setup ************************** 
  source_clock_select_TIMER('S');
  operating_mode_TIMER('U');
                                                                              TACCR0 = divider_value;

  //************************** ESP32 RELATED setup **************************
  ESP32_connected_setup();
  esp32_connected =  ESP32_connected();
  ESP32_LED_setup();

  if(esp32_connected){
    /* NOT LOW POWER CONFIGURATION */
    //The ESP32 is connected so turn on its led
    ESP32_LED_setup();
    ON_ESP32_LED();

    //************************** SPI comms configuration ESP32 *****************************
    config_SPI_A0_stim(&SPI_config);
    SPI_setup(&SPI_config);

    //************************** ESP32 communication setup ************************** 
    CS_ESP_PARAM_setup();
    ON_CS_ESP_PARAM_pin();

    CS_ESP_ECG_setup();
    ON_CS_ESP_ECG_pin();

    ACK_param_setup();
    OFF_ACK_param();
    new_param_setup();
    
    //************************** SD16 configuration *****************************
    // config_SD16A(&SD16A_configuration);
    // setup_SD16A(&SD16A_configuration);
    // start_conversion(); // While it is started, working in continuous mode will

    // SD16CCTL0 &= ~(SD16IE);   // Disabling SD16 interrupt
    IE2 &= ~(UCA0RXIE|UCA0TXIE);  // Disabling UART interrupt
  }else{
    OFF_ESP32_LED();
  }


  /* COMMON CONFIGURATION */
  //************************** INTAN setup ************************** 

  stim_en_OFF();
  initialize_INTAN(&INTAN_config);
  configure_INTAN(&INTAN_config);

  call_configuration_functions(&INTAN_config);

  INTAN_config.single_shot = false;
  while(1){
    switch (general_state) {
      case ENVIO_INTAN:{ // Estado 1: Muestreo del ECG y envío a través de SPI al ESP32
        
        new_param = new_param_read();
        if(new_param){
          general_state = RX_PARAMS_ESP32;
          break;
        }else{

          /*
            Send to the INTAN the convert command 
          */
          convert_channel(&INTAN_config, channel);
          send_SPI_commands_faster(&INTAN_config);
          received_channel_value_1 = (INTAN_config.obtained_RX[0] >> 24) & 0xFF;
          received_channel_value_2 = (INTAN_config.obtained_RX[0] >> 16) & 0xFF;
          // received_channel_value_3 = (INTAN_config.obtained_RX[0] >> 8)  & 0xFF;
          // received_channel_value_4 = INTAN_config.obtained_RX[0] & 0xFF;
          
          /*
            Resend to the ESP32 the received values from INTAN 
          */
          // // It is always sending data to the ESP32, if the timing pin is enabled then, the incorporated led will switch
          OFF_CS_ESP_PARAM_pin();
          while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
          __delay_cycles(CLK_10_CYCLES);
          UCA0TXBUF = 0x31;
          while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
          __delay_cycles(CLK_10_CYCLES);
          UCA0TXBUF = received_channel_value_1;
          while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
          __delay_cycles(CLK_10_CYCLES);
          UCA0TXBUF = received_channel_value_2;
          __delay_cycles(CLK_10_CYCLES);
          ON_CS_ESP_PARAM_pin();
          
          next_stim = button_pressed();
          if(next_stim){  
            number_of_stimulations_done = 0;
            state_stimulation = STIM;
            stim_rest_time = INTAN_config.stimulation_time;
          }

          /*
            SEND DATA TO INTAN BECAUSE OF STATE CHANGE caused by a timer            
          */

          if(TACTL & TAIFG){ // POLLING AL BIT DE INTERRUPCION DEL TIMER
            TACTL &= ~TAIFG; // limpiar el flag

            timer_flag_stim_rest++;
            timer_flag_on_off++;

            // update_stim_parameters(); 
            if(INTAN_config.single_shot == false){
              if(number_of_stimulations_done < INTAN_config.number_of_stimulations){ // si el número de estimulaciones hechas es menor al que se quiere hacer
                // ON_pin();
                switch (state_stimulation) {
                  case STIM:
                    if(timer_flag_stim_rest >= stim_rest_time){
                      state_stimulation = REST;
                      timer_flag_stim_rest = 0;
                      stim_rest_time = INTAN_config.resting_time;
                      number_of_stimulations_done++;
                      INTAN_programmed = false;

                      break;
                    }
                      switch (state_stimulation_ON_OFF) {
                        case ON_P:
                          if(timer_flag_on_off >=  INTAN_config.stimulation_on_time){
                            state_stimulation_ON_OFF = OFF_P;
                            timer_flag_on_off = 0;
                            // stim_on_off_time = INTAN_config.stimulation_off_time;
                            INTAN_programmed = false;
                            break;
                          }          
                          if(!INTAN_programmed){
                            INTAN_config.stimulation_on[stim_channel] = 1;
                            INTAN_config.stimulation_pol[stim_channel] = 'P';
                            ON_INTAN_FASTER(&INTAN_config, stim_channel);
                            INTAN_programmed = true;
                          }
                          
                          break;

                        case OFF_P:
                          if(timer_flag_on_off >= INTAN_config.stimulation_off_time){
                            state_stimulation_ON_OFF = ON_N;
                            timer_flag_on_off = 0;
                            // stim_on_off_time = INTAN_config.stimulation_on_time;
                            INTAN_programmed = false;
                            break;
                          }          
                          if(!INTAN_programmed){
                            OFF_INTAN_FASTER(&INTAN_config);
                            INTAN_programmed = true;
                          }
                          
                          
                          break;

                        case ON_N:
                          if(timer_flag_on_off >= INTAN_config.stimulation_on_time){
                            state_stimulation_ON_OFF = OFF_N;
                            timer_flag_on_off = 0;
                            // stim_on_off_time = INTAN_config.stimulation_off_time;
                            INTAN_programmed = false;
                            break;
                          }
                          if(!INTAN_programmed){
                            INTAN_config.stimulation_on[stim_channel] = 1;
                            INTAN_config.stimulation_pol[stim_channel] = 'N';
                            ON_INTAN_FASTER(&INTAN_config, stim_channel);
                            INTAN_programmed = true;
                          }

                          
                          break;

