alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKK-stim-sense-INTAN/003_STIM_SENSE_IKKI_not_lpm_single_shot.c
                        case  OFF_N:
                          if(timer_flag_on_off >= INTAN_config.stimulation_off_time){
                            state_stimulation_ON_OFF = ON_P;
                            timer_flag_on_off = 0;
                            // stim_on_off_time = INTAN_config.stimulation_on_time;
                            INTAN_programmed = false;
                            break;
                          }
                          if(!INTAN_programmed){
                            OFF_INTAN_FASTER(&INTAN_config);
                            INTAN_programmed = true;
                          }
                          break;

                      }
                    break;

                  case REST:
                      if(timer_flag_stim_rest >= stim_rest_time){
                        state_stimulation = STIM;
                        timer_flag_stim_rest = 0;
                        stim_rest_time = INTAN_config.stimulation_time;
                        state_stimulation_ON_OFF = ON_P;
                        INTAN_programmed = false;
                        break;
                      }
                      if(!INTAN_programmed){
                        OFF_INTAN_FASTER(&INTAN_config);
                        INTAN_programmed = true;
                      }
                    break;
                
                }
              }else{
                next_stim = button_pressed();
                OFF_pin();
              }
            }else{

              next_stim = button_pressed();
              if(next_stim){
                if(!locked_button){
                  INTAN_programmed = false;
                  timer_flag_on_off = 0;

                }
                locked_button = true;
              }else{
                locked_button = false;
              }
              if(!INTAN_programmed){
                INTAN_config.stimulation_on[stim_channel] = 1;
                INTAN_config.stimulation_pol[stim_channel] = 'P';
                ON_INTAN_FASTER(&INTAN_config, stim_channel);
                INTAN_programmed = true;
              }
              if(timer_flag_on_off >=  INTAN_config.stimulation_on_time){
                OFF_INTAN_FASTER(&INTAN_config);
                break;
              }   


              


            }
          }
        }
        break;
      } 
   

      case RX_PARAMS_ESP32:{// Estado 2: Recepción de parámetros de estimulación nuevos a través del ESP32
        receive_parameters_ESP32(&INTAN_config);
        general_state = NEW_PARAM_OFF_WAIT;
        break;
      
      } 
      
      case NEW_PARAM_OFF_WAIT:{ // Estado 3: Espera a la bajada del pinde comunicaciones
        new_param = new_param_read();
        if(!new_param){
          general_state = TX_PARAMS_INTAN;
          break;
        }
        break;
      }

      case TX_PARAMS_INTAN:{ // Estado 4: actualización de parámetros de estimulación del INTAN
        general_state = ENVIO_INTAN;
        number_of_stimulations_done = 100;

        // The next both functions do the same but are defined a little different
        // call_configuration_functions(&INTAN_config);
        INTAN_function_update(&INTAN_config);


        OFF_ACK_param();
        break;        
      }

      default:
        break;

    }

    // Comprobar los flags del timer y actualizar parámetros del INTAN si es necesario
  
  }




}
// Timer A0 interrupt service routine
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(TIMERA0_VECTOR))) Timer_A (void)
#else
#error Compiler not supported!
#endif
{

  timer_flag_stim_rest++;
  timer_flag_on_off++;
  button_init();
  next_stim = button_pressed();
  if(next_stim){
    number_of_stimulations_done = 0;
    state_stimulation = STIM;
  }

  update_stim_parameters();
}
